DocumentJournals/ЭлектроннаяПочта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>ЭлектроннаяПочта</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Адресаты</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ПолучателиПисьмаСтрокой</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Важность</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Важность</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Важность</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидМаршрутизации</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ВидМаршрутизации</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ВидМаршрутизации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаОтправкиПолучения</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаПолучения</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЕстьВложения</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ЕстьВложения</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ЕстьВложения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерСпособаАдресации</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.НомерСпособаАдресации</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.НомерСпособаАдресации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Отправитель</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ОтправительКонтакт</xr:Item>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ОтправительАдресат</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОтправкаОтменена</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ОтправкаОтменена</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Отправлено</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаОтправки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Папка</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Папка</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Папка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Получатели</Name>
					<References>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.ПолучателиПисьмаСтрокой</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Получено</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.ДатаПолучения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Предмет</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Предмет</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Предмет</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Размер</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Размер</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Размер</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Тема</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.Тема</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.Тема</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<References>
						<xr:Item>Document.ВходящееПисьмо.Attribute.УчетнаяЗапись</xr:Item>
						<xr:Item>Document.ИсходящееПисьмо.Attribute.УчетнаяЗапись</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Enums/ТипыАдресатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыАдресатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытаяКопия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбратныйАдрес</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыТекстовПочтовыхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТекстовПочтовыхСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиРассчитыватьПланПроекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейЗагрузкиИзВнешнегоФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительностиЗадач</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыДлительности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаТрудозатратЗадач</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыТрудозатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSProject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение подготовившего</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируетсяВСтороннейСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьЗатратыНаПроект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВнешнийФайл</Name>
					<Comment>Хранит ссылку на файл в ИБ или путь к файлу на диске</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПланНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПланОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПланТрудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_Страна</Name>
					<Comment>Страна, в которой реализуется проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_АЭС</Name>
					<Comment>Признак того, что проект является АЭС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_НаименованиеEn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроектнаяКоманда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьИсполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьОсновнойОбъектАдресации</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДополнительныйОбъектАдресации</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВПроекте</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DocumentJournals/ЭлектроннаяПочта/Forms/ПросмотрВложенногоПисьма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФайлПисьма") Тогда
		
		ФайлВложенногоПисьма = Параметры.ФайлПисьма;
		
		ДвоичныеДанные = РаботаСФайламиВызовСервера.ПолучитьДвоичныеДанныеФайла(ФайлВложенногоПисьма);
		
	ИначеЕсли Параметры.Свойство("ДвоичныеДанные") Тогда	
		
		ДвоичныеДанные = Параметры.ДвоичныеДанные;
		
	Иначе	
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	ПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение;
	ПочтовоеСообщение.УстановитьИсходныеДанные(ДвоичныеДанные);
	
	Сообщение = Почта.ПолучитьСтруктуруПочтовогоСообщенияИзПисьма(ПочтовоеСообщение);
	
	Тема = РаботаСоСтроками.УдалитьНедопустимыеСимволыXML(Сообщение.Тема);
	Важность = Сообщение.Важность;
	ДатаПолучения = Сообщение.ДатаПолучения;
	
	ОтправительАдресат = ВстроеннаяПочтаСерверПовтИсп.ПолучитьПочтовогоАдресата(
		Сообщение.Отправитель.Адрес,Сообщение.Отправитель.ОтображаемоеИмя);
		
	ДобавитьПолучателя(
		НСтр("ru = 'От:'; en = 'From:'"),
		ОтправительАдресат);
		
	ЗаполнитьИнтернетПочтовыеАдреса(Перечисления.ТипыАдресатов.Кому, Сообщение.Получатели);
	ЗаполнитьИнтернетПочтовыеАдреса(Перечисления.ТипыАдресатов.Кому, Сообщение.Копии);
	
	СтруктураТекста = ВстроеннаяПочтаСервер.ПолучитьСтруктуруТекстаИзСтруктурыПочтовогоСообщения(Сообщение);
	ТипТекста = СтруктураТекста.ТипТекста;
	
	ПоказыватьКартинкиВТелеПисьма = Ложь;
	ТекстПисьмаНРег = "";
	Если СтруктураТекста.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.HTML Тогда
		ПоказыватьКартинкиВТелеПисьма = Истина;
		ТекстПисьмаНРег = НРег(СтруктураТекста.ТекстHTML);
	КонецЕсли;	
	
	//Сообщение.Вложения
	Для Каждого ВложениеСтрока Из Сообщение.Вложения Цикл
		
		Если ПоказыватьКартинкиВТелеПисьма Тогда
			
			Если ЗначениеЗаполнено(ВложениеСтрока.Идентификатор) 
				И СтрНайти(ТекстПисьмаНРег, НРег(ВложениеСтрока.Идентификатор)) <> 0 Тогда
				Вложение = ВложенияКартинки.Добавить();
			Иначе	
				Вложение = Вложения.Добавить();
			КонецЕсли;	
			
		Иначе	
			Вложение = Вложения.Добавить();
		КонецЕсли;	
		
		Вложение.ИмяФайла =
			ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ВложениеСтрока.Имя, "_");
			
		Если НРег(ВложениеСтрока.ТипСодержимого) = НРег("message/rfc822") Тогда
			Вложение.ЭтоВложенноеПисьмо = Истина;
		КонецЕсли;	
			
		Вложение.Представление = Вложение.ИмяФайла;	
		Вложение.Идентификатор = ВложениеСтрока.Идентификатор;
			
		Вложение.Адрес = ПоместитьВоВременноеХранилище(ВложениеСтрока.Данные, УникальныйИдентификатор);
		Вложение.Размер = ВложениеСтрока.Данные.Размер();
		
		ИмяФайлаИнфо = РаботаСоСтроками.РазложитьИмяФайла(Вложение.ИмяФайла);
		Вложение.Расширение = ИмяФайлаИнфо.Расширение;
		Вложение.ИндексКартинки = ФайловыеФункцииКлиентСервер.ПолучитьИндексПиктограммыФайла(ИмяФайлаИнфо.Расширение);
		Вложение.РазмерПредставление = РаботаСоСтроками.ПолучитьРазмерСтрокой(Вложение.Размер);
			
	КонецЦикла;	
	
	Если СтруктураТекста.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.HTML Тогда
		
		ТекстПисьма = СтруктураТекста.ТекстHTML;
		
		ВстроеннаяПочтаСервер.ДобавитьНеобходимыеТэгиHTML(ТекстПисьма);
		
		// тут вставка картинок
		ВставитьКартинкиВТекстHTML(
			ТекстПисьма,
			УникальныйИдентификатор);
		
	Иначе
		
		ТекстПисьма = РаботаС_HTML.ПолучитьHTMLИзТекста(СтруктураТекста.Текст);
		
	КонецЕсли;
	
	ИдентификаторПроектаСтрока = ВстроеннаяПочтаСервер.ПолучитьЗначениеПоляИзЗаголовкаПисьма(Сообщение.Заголовок, "X-1C-Project-ID");
	Если ЗначениеЗаполнено(ИдентификаторПроектаСтрока) Тогда
		
		ИдентификаторПроекта = Неопределено;
		
		Попытка
			ИдентификаторПроекта = Новый УникальныйИдентификатор(ИдентификаторПроектаСтрока);
		Исключение
			// может придти некорректный Ид проекта
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ИдентификаторПроекта) Тогда
			ПроектПисьма = Справочники.Проекты.ПолучитьСсылку(ИдентификаторПроекта);
			Если ЗначениеЗаполнено(ПроектПисьма) 
				И ДокументооборотПраваДоступа.ПолучитьПраваПоОбъекту(ПроектПисьма).Чтение Тогда 
				Проект = ПроектПисьма;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнтернетПочтовыеАдреса(ТипАдреса, Адреса)
	
	Для каждого Адрес Из Адреса Цикл
		
		Если Не РаботаСоСтроками.ЭтоАдресЭлектроннойПочты(Адрес.Адрес) Тогда
			Продолжить;
		КонецЕсли;
		
		Адресат = ВстроеннаяПочтаСерверПовтИсп.ПолучитьПочтовогоАдресата(Адрес.Адрес, Адрес.ОтображаемоеИмя);
		
		ДобавитьПолучателя(ТипАдреса, Адресат);
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолучателя(ТипАдреса, ПочтовыйАдресат)
	
	НоваяСтрока = Получатели.Добавить();
	ДанныеПолучателя = ВстроеннаяПочтаСервер.ПолучитьПредставлениеИКонтактАдресата(ПочтовыйАдресат);
	НоваяСтрока.Представление = ДанныеПолучателя.Представление;
	НоваяСтрока.Контакт = ДанныеПолучателя.Контакт;
	НоваяСтрока.Адресат = ПочтовыйАдресат;
 	НоваяСтрока.ТипАдреса = ТипАдреса;
	НоваяСтрока.Адрес = ПочтовыйАдресат.Адрес;
	НоваяСтрока.Внешний = ДанныеПолучателя.Внешний;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаДанных = Получатели.НайтиПоИдентификатору(Элементы.Получатели.ТекущаяСтрока);
	Если ЗначениеЗаполнено(СтрокаДанных.Контакт) Тогда
		ПоказатьЗначение(, СтрокаДанных.Контакт);
	КонецЕсли;
	
КонецПроцедуры

// При работе с веб сервером вставляет картинки письма в тело HTML,
// иначе помещает их во временное хранилище и заменяет ссылки на временное хранилище.
//
// Параметры
//  ТекстHTML - html текст - тела письма - входной и выходной параметр (туда же и пишутся изменения)
//  Письмо - ссылка на письмо (вх или исх)
//  УникальныйИдентификаторФормы - идентификатор формы
//  ИдентификаторыКартинокИсходящегоПисьма - список значений, в нем структуры "ИсточникФайла, НавигационнаяСсылка"
//      ИсточникФайла - это "id" в теге <img src=id....
//		НавигационнаяСсылка - навигационная ссылка на картинку у нас во временном хранилище
//
Процедура ВставитьКартинкиВТекстHTML(
	ТекстHTML,
	УникальныйИдентификаторФормы,
	ИдентификаторыКартинокИсходящегоПисьма = Неопределено)
	
	Для каждого ФайлПисьма Из ВложенияКартинки Цикл
		
		ВставлятьКакBase64 = Истина;
		
		ИсточникФайла = ФайлПисьма.Идентификатор;
		
		Если СтрЧислоВхождений(ТекстHTML, ИсточникФайла) > 0 Тогда
			
			Если ВставлятьКакBase64 Тогда
				
				ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ФайлПисьма.Адрес);
				
				Расширение = ФайлПисьма.Расширение;
				
				Если ПустаяСтрока(Расширение) Тогда
					Картинка = Новый Картинка(ДвоичныеДанныеФайла);
					Расширение = Строка(Картинка.Формат());
				КонецЕсли;
				
				СтрокаИсточника = "data:image/" + Расширение + ";base64," + Base64Строка(ДвоичныеДанныеФайла);
				ТекстHTML = СтрЗаменить(ТекстHTML, "cid:" + ИсточникФайла, СтрокаИсточника);
				ТекстHTML = СтрЗаменить(ТекстHTML, "CID:" + ИсточникФайла, СтрокаИсточника);
				Если СтрДлина(ИсточникФайла) > 18 Тогда
					ТекстHTML = СтрЗаменить(ТекстHTML, ИсточникФайла, СтрокаИсточника);
				КонецЕсли;	
				
			Иначе // тонкий клиент
				
				НавигационнаяСсылкаИнформационнойБазы = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
				
				Попытка
					НавигационнаяССылка = ФайлПисьма.Адрес;
				Исключение
					Инфо = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации(
						НСтр("ru = 'Ошибка вставки картинок в HTML'; en = 'Error pasting images into HTML'", Метаданные.ОсновнойЯзык.КодЯзыка),
						УровеньЖурналаРегистрации.Ошибка,,
						,
						ПодробноеПредставлениеОшибки(Инфо));
					Продолжить;
				КонецПопытки;	
				
				АбсолютнаяСсылкаНаКартинку = НавигационнаяСсылкаИнформационнойБазы + "/" + НавигационнаяССылка;
				
				ТекстHTML = СтрЗаменить(ТекстHTML, "http:cid:" + ИсточникФайла, АбсолютнаяСсылкаНаКартинку); // коррекция ошибочного html
				ТекстHTML = СтрЗаменить(ТекстHTML, "cid:" + ИсточникФайла, АбсолютнаяСсылкаНаКартинку);
				ТекстHTML = СтрЗаменить(ТекстHTML, "CID:" + ИсточникФайла, АбсолютнаяСсылкаНаКартинку);
				Если СтрДлина(ИсточникФайла) > 18 Тогда
					ТекстHTML = СтрЗаменить(ТекстHTML, ИсточникФайла, АбсолютнаяСсылкаНаКартинку);
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВложенияВыборОбработка();
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияВыборОбработка()
	
	Вложение = Элементы.Вложения.ТекущиеДанные;

	#Если ВебКлиент Тогда
		ПолучитьФайл(Вложение.Адрес, Вложение.ИмяФайла, Истина);
	#Иначе
		
		Если Не Вложение.ЭтоВложенноеПисьмо Тогда
			ДелопроизводствоКлиент.ОткрытьФайлИзВременногоХранилища(Вложение.Адрес, Вложение.ИмяФайла);
		Иначе
			ОткрытьПисьмоИзВременногоХранилища(Вложение.Адрес, Вложение.ИмяФайла);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
// Копирует файл из временного хранилища на клиента и открывает его для просмотра
//
Процедура ОткрытьПисьмоИзВременногоХранилища(АдресВоВременномХранилище, ИмяФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Если ДвоичныеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить файл. Возможно он был удален.'; en = 'Failed to get file. Perhaps it was deleted.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("ДвоичныеДанные", ДвоичныеДанные);
	ОткрытьФорму(
		"ЖурналДокументов.ЭлектроннаяПочта.Форма.ПросмотрВложенногоПисьма", 
		ПараметрыОткрытия,
		ЭтаФорма,,,,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПисьмаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если Найти(ДанныеСобытия.Href, "javascript") <> 0 Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	ВстроеннаяПочтаКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element, Неопределено, Элемент.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьВложение(Команда)
	
	ВложенияВыборОбработка();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеКак(Команда)
	
	Вложение = Элементы.Вложения.ТекущиеДанные;

	#Если ВебКлиент Тогда
		Возврат;
	#КонецЕсли
		
	Если Вложение.ЭтоВложенноеПисьмо Тогда
		Возврат;
	КонецЕсли;
		
	// Выбираем путь к файлу на диске.
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.ПолноеИмяФайла = Вложение.ИмяФайла;
	ВыборФайла.Расширение = Вложение.Расширение;
	Фильтр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Все файлы (*.%1)|*.%1'; en = 'All files (*.%1) | *.%1'"), Вложение.Расширение, Вложение.Расширение);
	ВыборФайла.Фильтр = Фильтр;
	
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыборФайла.ПолноеИмяФайла;
	
	Файл = Новый Файл(ПолноеИмяФайла);
	
	ИмяФайла = Вложение.ИмяФайла;
	
	РазмерВМб = Вложение.Размер / (1024 * 1024);
	
	ТекстПояснения =
	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выполняется сохранение файла ""%1"" (%2 Мб)...
			       |Пожалуйста, подождите.';
			       |en = 'Saving file ""%1"" (%2 mb) ... 
			       |Please wait.'"),
		ИмяФайла, 
		ФайловыеФункцииСлужебныйКлиентСервер.ПолучитьСтрокуСРазмеромФайла(РазмерВМб));
		
	Состояние(ТекстПояснения);
	
	АдресФайла = Вложение.Адрес;
	
	ПередаваемыеФайлы = Новый Массив;
	Описание = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, АдресФайла);
	ПередаваемыеФайлы.Добавить(Описание);
	
	ПутьКФайлу = Файл.Путь;
	ПутьКФайлу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКФайлу);
	
	// Сохраним Файл из БД на диск.
	Если ПолучитьФайлы(ПередаваемыеФайлы,, ПутьКФайлу, Ложь) Тогда
		
	КонецЕсли;
			
	Состояние(НСтр("ru = 'Файл успешно сохранен'; en = 'The file was saved successfully'"), , ПолноеИмяФайла);
			
КонецПроцедуры
